# IsLayerActive Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaReinforcement..::..IsLayerActive Method
AreaReinforcement Class See Also
---
Identifies if the layer is active or not.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool IsLayerActive(
	AreaReinforcementLayerType layer
)
```

Visual Basic
---
```text
Public Function IsLayerActive ( _
	layer As AreaReinforcementLayerType _
) As Boolean
```

Visual C++
---
```text
public:
bool IsLayerActive(
	AreaReinforcementLayerType layer
)
```

# ### Parameters
layer
    Type: Autodesk.Revit.DB.Structure..::..AreaReinforcementLayerType The layer that will be tested.
# ### Return Value
Returns true if the input layer is active, false otherwise
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace